dima2/src/Catalogs/ЭлементыФинансовыхОтчетов/ЭлементыФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыФинансовыхОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыБюджетов</owners>
  <owners>Catalog.ВидыФинансовыхОтчетов</owners>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовФинансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>Наименование для печати, представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйЗнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыВидаЭлемента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперандыФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операнд</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыТаблицы</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВОтдельнойКолонке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыОформления</name>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОформляемойОбласти</name>
      <type>
        <types>EnumRef.ТипыОформляемыхОбластейБюджетныхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеСтроки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеКолонки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПолейОтбораЭО</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоляОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиЗначений</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавляемыеЗначенияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

dima2/src/Catalogs/ЭлементыФинансовыхОтчетов/Forms/ПериодВидаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Справочники.ЭлементыФинансовыхОтчетов.ФормаПриСозданииНаСервере(ЭтаФорма);
	Заголовок = Параметры.ВидЭлемента;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДопРежим = Перечисления.ДополнительныеРежимыЭлементовОтчетов.ВидОтчета;
	Справочники.ЭлементыФинансовыхОтчетов.ФормаПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ, ДопРежим);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(АдресЭлементаВХранилище) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	Объект.НаименованиеДляПечати = Строка(Периодичность);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ФинансоваяОтчетностьКлиент.ЗавершитьРедактированиеЭлементаОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
